Revit 2027 API
IndexBuffer.GetIndexStreamTriangle Method
 Gets a stream that can be used to write IndexTriangle primitives into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IndexStreamTriangle GetIndexStreamTriangle()
Public Function GetIndexStreamTriangle As IndexStreamTriangle
public:
IndexStreamTriangle^ GetIndexStreamTriangle()
member GetIndexStreamTriangle : unit -> IndexStreamTriangle
Return Value
IndexStreamTriangle
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
Reference
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace